Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.#ctor
Initializes a new instance of the FilterExpressionGenerator class.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.Generate(Tekla.Structures.Filtering.FilterExpression)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified Tekla.Structures.Filtering.FilterExpression object and returns it as a string.
FilterExpression: The Tekla.Structures.Filtering.FilterExpression object to be generated.
Returns: A string containing the filter.
Throws System.ArgumentNullException: Thrown when a null FilterExpression is specified.
Throws Tekla.Structures.Filtering.InvalidFilterExpressionException:
Thrown when an invalid FilterExpression is specified.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.Generate(Tekla.Structures.Filtering.FilterExpression,Tekla.Structures.Filtering.FilterExpressionFileType,System.String)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified Tekla.Structures.Filtering.FilterExpression object and saves it as a text file.
FilterExpression: The Tekla.Structures.Filtering.FilterExpression object to be generated.
FilterExpressionFileType: The Tekla.Structures.Filtering.FilterExpressionFileType to be generated.
FullFileName: The full file name of the file to be saved.
Returns: A string containing the filter's full file name.
Throws System.ArgumentNullException:
Thrown when a null FilterExpression or FullFileName is specified.
Throws Tekla.Structures.Filtering.InvalidFilterExpressionException:
Thrown when an invalid FilterExpression is specified.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.Generate(Tekla.Structures.Filtering.FilterExpression,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified FilterExpression object and uses a TextWriter for the output.
Override this method to change the class behavior.
FilterExpression: The Tekla.Structures.Filtering.FilterExpression object to be generated.
TextWriter: The TextWriter object for the output.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateExpression(Tekla.Structures.Filtering.Expression,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified Expression object and uses a TextWriter for the output.
Override this method to change the class behavior.
Expression: The Expression object to be generated.
TextWriter: The TextWriter object for the output.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateBinaryFilterExpression(Tekla.Structures.Filtering.BinaryFilterExpression,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified BinaryFilterExpression object and uses a TextWriter for the output.
Override this method to change the class behavior.
BinaryFilterExpression: The BinaryFilterExpression object to be generated.
TextWriter: The TextWriter object for the output.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateFilterExpression(Tekla.Structures.Filtering.DataFilterExpression,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified DataFilterExpression object and uses a TextWriter for the output.
Override this method to change the class behavior.
FilterExpression: The DataFilterExpression object to be generated.
TextWriter: The TextWriter object for the output.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateOperatorType(Tekla.Structures.Filtering.OperatorType,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified OperatorType enum and uses a TextWriter for the output.
Override this method to change the class behavior.
OperatorType: The OperatorType object to be generated.
TextWriter: The TextWriter object for the output.
Throws System.NotSupportedException: Thrown when a not supported OperatorType is specified.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateBinaryFilterItemOperatorType(Tekla.Structures.Filtering.BinaryFilterOperatorType,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified BinaryFilterOperatorType enum and uses a TextWriter for the output.
Override this method to change the class behavior.
BinaryFilterItemOperatorType: The BinaryFilterOperatorType object to be generated.
TextWriter: The TextWriter object for the output.
Throws System.NotSupportedException:
Thrown when a not supported BinaryFilterItemOperatorType is specified.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GenerateBinaryFilterExpressionCollection(Tekla.Structures.Filtering.BinaryFilterExpressionCollection,System.IO.TextWriter)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Generates a filter for the specified BinaryFilterExpressionCollection object and uses a TextWriter for the output.
Override this method to change the class behavior.
BinaryFilterExpressionCollection: The BinaryFilterExpressionCollection object to be generated.
TextWriter: The TextWriter object for the output.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GetFilterExpressionsCount(Tekla.Structures.Filtering.Expression,System.Int32@)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Gets the number of FilterExpressions in the current Expression.
Expression: The Expression to be analyzed.
Count: The number of the filter expressions.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGenerator.GetFilterExpressionFileExtension(Tekla.Structures.Filtering.FilterExpressionFileType)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Gets the filter file extension.
FilterExpressionFileType: The filter file type.
Returns: A string representing the file extension.